## sso_proxy
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 5 to add, 2 to change, 5 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.pomerium_sso_proxy will be updated in-place
  ~ resource "aws_ecs_service" "pomerium_sso_proxy" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/pomerium_sso_proxy/pomerium_sso_proxy"
        name                               = "pomerium_sso_proxy"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:7" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_service.pomerium_sso_proxy_auth will be updated in-place
  ~ resource "aws_ecs_service" "pomerium_sso_proxy_auth" {
        id                                 = "arn:aws:ecs:ca-central-1:794722365809:service/pomerium_sso_proxy_auth/pomerium_sso_proxy_auth"
        name                               = "pomerium_sso_proxy_auth"
        tags                               = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy_auth:2" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.pomerium_sso_proxy must be replaced
-/+ resource "aws_ecs_task_definition" "pomerium_sso_proxy" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy:7" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0 -> null
                  - mountPoints      = [] -> null
                    name             = "pomerium_sso_proxy"
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                },
            ]
        )
      ~ execution_role_arn       = "arn:aws:iam::794722365809:role/container_execution_role" -> (known after apply) # forces replacement
      ~ id                       = "pomerium_sso_proxy" -> (known after apply)
      ~ revision                 = 7 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.pomerium_sso_proxy_auth must be replaced
-/+ resource "aws_ecs_task_definition" "pomerium_sso_proxy_auth" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:794722365809:task-definition/pomerium_sso_proxy_auth:2" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  - cpu              = 0 -> null
                  - mountPoints      = [] -> null
                    name             = "pomerium_sso_proxy_auth"
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                },
            ]
        )
      ~ execution_role_arn       = "arn:aws:iam::794722365809:role/container_execution_role" -> (known after apply) # forces replacement
      ~ id                       = "pomerium_sso_proxy_auth" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
        tags                     = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
        # (8 unchanged attributes hidden)
    }

  # aws_iam_role.pomerium_container_execution_role must be replaced
-/+ resource "aws_iam_role" "pomerium_container_execution_role" {
      ~ arn                   = "arn:aws:iam::794722365809:role/container_execution_role" -> (known after apply)
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Principal = {
                          ~ Service = [
                                "ecs.amazonaws.com",
                              - "ecs-tasks.amazonaws.com",
                                "ec2.amazonaws.com",
                              + "ecs-tasks.amazonaws.com",
                            ]
                        }
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
      ~ create_date           = "2022-04-21T20:48:27Z" -> (known after apply)
      ~ id                    = "container_execution_role" -> (known after apply)
      ~ managed_policy_arns   = [
          - "arn:aws:iam::794722365809:policy/PomeriumSSOContainerExecutionPolicies",
          - "arn:aws:iam::aws:policy/service-role/AmazonEC2ContainerServiceforEC2Role",
        ] -> (known after apply)
      ~ name                  = "container_execution_role" -> "pomerium_container_execution_role" # forces replacement
      + name_prefix           = (known after apply)
        tags                  = {
            "CostCentre" = "security-tools-794722365809"
            "Product"    = "security-tools-sso-proxy"
            "Terraform"  = "true"
        }
      ~ unique_id             = "AROA3SCJE6FY6C6QEWDHV" -> (known after apply)
        # (4 unchanged attributes hidden)

      - inline_policy {}
      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.ce_cs must be replaced
-/+ resource "aws_iam_role_policy_attachment" "ce_cs" {
      ~ id         = "container_execution_role-20220421204828822900000003" -> (known after apply)
      ~ role       = "container_execution_role" -> "pomerium_container_execution_role" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_iam_role_policy_attachment.pomerium_policies must be replaced
-/+ resource "aws_iam_role_policy_attachment" "pomerium_policies" {
      ~ id         = "container_execution_role-20220422144044860900000001" -> (known after apply)
      ~ role       = "container_execution_role" -> "pomerium_container_execution_role" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 5 to add, 2 to change, 5 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

17 tests, 17 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
